// let a = 1
// let b = 2**10
// let i = 2
// while (i**a <= b){
//      console.log(i**a, end = ` `)
//     a += 1
// }
// 1. Написать скриптик, который сосчитает и выведет результат от возведения 2 в степень 10, начиная со степени 1

// function exponentiation(a) {let i = 2; console.log(i**a)}

// exponentiation(10)


// 1*. Преобразовать 1 задачу в функцию, принимающую на вход степень, в которую будет возводиться число 2


// 2. Написать скрипт, который выведет 5 строк в консоль таким образом, чтобы в первой строчке выводилось :), во второй :):) и так далее
// Пример в консоли:
// :)
// :):)
// :):):)
// :):):):)
// :):):):):)





function printSmile(string) {let smile = `:)`; console.log(string + smile)}


printSmile(1)

// 2*. Преобразовать 2 задачу в функцию, принимающую на вход строку,
// которая и будет выводиться в консоль (как в условии смайлик), а также количество строк для вывода 
// e.g. function printSmile(stroka, numberOfRows)
