// let a = 1
// let b = 2**10
// let i = 2
// while (i**a <= b){
//      console.log(i**a, end = ` `)
//     a += 1
// }
// 1. Написать скриптик, который сосчитает и выведет результат от возведения 2 в степень 10, начиная со степени 1

// function exponentiation(a) {let i = 2; console.log(i**a)}

// exponentiation(10)


// 1*. Преобразовать 1 задачу в функцию, принимающую на вход степень, в которую будет возводиться число 2


// 2. Написать скрипт, который выведет 5 строк в консоль таким образом, чтобы в первой строчке выводилось :), во второй :):) и так далее
// Пример в консоли:
// :)
// :):)
// :):):)
// :):):):)
// :):):):):)

let a = `:)`
while(a <= 5) {
console.log(a)
 a += 1
 }
